#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag                   = "59109529b862405026ab30a212337945" -> "5fe443268d5fc1b6db99a5a9d0647e18"
        id                     = "lambdas/demo/add_investment_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag                   = "786afdfc5e23db22c60e3cdce976bd29" -> "4a06572338fa70fd59ea1faa0aaea705"
        id                     = "lambdas/demo/add_scenario_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag                   = "bc6d00cd2d6ef20e5d0f044bec43317b" -> "3acd4ec99a0070446d70ec560120a477"
        id                     = "lambdas/demo/add_tag_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag                   = "d8a7065af7797eeccc8e1f6474a2cda9" -> "810452c4528f79989946c165bc001945"
        id                     = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag                   = "ce8e66d7929d3bed051db73d1336882a" -> "37c6133ccc9f350aa7fa9577b9363808"
        id                     = "lambdas/demo/assign_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag                   = "8d1f4fb13d8b69d716945640695aae4c" -> "3c6400f4dbbcbe71ddb6106cb744f38c"
        id                     = "lambdas/demo/authorize_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag                   = "640ef1d30cc8c676602d77ad43a2df24" -> "2f8116738b36a84c4d51547689a58942"
        id                     = "lambdas/demo/change_company_publicly_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag                   = "7243ba16cfeda405a39b5a157122a431" -> "9e81b9107c64b76764e47df8fb1ae0a4"
        id                     = "lambdas/demo/change_user_role_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag                   = "183ed4596bce81a9d1b0706ec05b2707" -> "444d8a7bd848ca4fcfd9d8fda1752fac"
        id                     = "lambdas/demo/connect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag                   = "0f4705f5c47bb28ecd25d1d5911e7fbf" -> "651b142853955fc949281f740cf38d3e"
        id                     = "lambdas/demo/delete_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag                   = "24447e3c0ef8c03862445f4903e53c97" -> "df458d8e9817f4a20f50562584c22461"
        id                     = "lambdas/demo/delete_scenarios_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag                   = "d20b0be2832af54fb8c780b5df0ec8d0" -> "32fcaeb8e4183f4f781f1de1330fcf4b"
        id                     = "lambdas/demo/delete_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag                   = "42943f032cda67ff70ec103f7eff6822" -> "0f2e91c94250664fbe012422af28a6db"
        id                     = "lambdas/demo/disconnect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag                   = "9eb0bc7abb1305fcce24c794c0d93106" -> "a3e63311e36b57e91537215790079096"
        id                     = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag                   = "ebb647ba701ae70603275d7d3705e3b3" -> "0e634b02bde93393dcf30b49eecee717"
        id                     = "lambdas/demo/edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag                   = "fd670b88e6d400d4e5106e22bdf9b681" -> "78fd9901d2a874c638cd15f6ee14a40b"
        id                     = "lambdas/demo/get_all_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag                   = "0386cc15e103c255d1e497db5e5d470e" -> "52c1f2291259fe38f08f39aa61e965b4"
        id                     = "lambdas/demo/get_all_public_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag                   = "be4cd198f204f6dfdc7f79103a6550fb" -> "29aa6b673268f46917ad4287ef5d29dc"
        id                     = "lambdas/demo/get_all_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag                   = "df53a95efdc4752a3d259d7ad2ce2f52" -> "c7329a63abb6936d2b9d4909f444d856"
        id                     = "lambdas/demo/get_all_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag                   = "8bbc7213914231237e3cb8a6ddb0c637" -> "e3b56d8fe2f0445fcf797e1bf4e08b4e"
        id                     = "lambdas/demo/get_by_metric_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag                   = "7f477898286c1c9d99e04018c9734635" -> "9975c34ad97f8fe738f83ea3f6ce4b36"
        id                     = "lambdas/demo/get_company_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag                   = "b3eb58e90b2bc5d259d9500d75581d0e" -> "80ef49e1ecf1a5137fc4543d96b07c37"
        id                     = "lambdas/demo/get_company_investments_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag                   = "9172ed92b557543afb85d7b494e66389" -> "ffbdd003eb9919ab2aa3a734c5a6052c"
        id                     = "lambdas/demo/get_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag                   = "f82782064b776f5002981133805ed64c" -> "a5fda673c51f919b65a6e3ea36a8c2c5"
        id                     = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag                   = "9788ff6d2a0acf4ab10ee94fde39b897" -> "008085de8effef4de5cafbb4b1f9ef45"
        id                     = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag                   = "03e1e9a10ea957801e7018fc347b0928" -> "4c9d8f0060405f27bb97943aa3f33b56"
        id                     = "lambdas/demo/get_dynamic_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag                   = "153794310a7533ac14603649f0efcf56" -> "1bf13088502dfa7b58ccf494437cc1b0"
        id                     = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag                   = "bffb163b6cadf2caef714c42f78b2771" -> "650426195a1a8a004b9cda1d006de564"
        id                     = "lambdas/demo/get_full_year_total_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag                   = "fdd82b856b9ab1a7dc04a61c939503fa" -> "b7e89cb4a0c1a097e948b14c9a54e005"
        id                     = "lambdas/demo/get_investment_date_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag                   = "0c81b05a67d63b7e74331bfc7e39e4ba" -> "5a3f62a559802359453f2adf2b059b3f"
        id                     = "lambdas/demo/get_metric_types_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_quarters_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_quarters_report_function_object" {
      ~ etag                   = "b653cf6c8be483286da4a68dff4406c1" -> "c85bbf2692a2e7d3a2c0cf7f0f1794df"
        id                     = "lambdas/demo/get_quarters_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag                   = "0c3845ef2cf149f4ddaadde56818c310" -> "569222c1ac1b9e73384a0e6f8e7dac85"
        id                     = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag                   = "4dab210569d0cdea4c341bf5d468b6f2" -> "40b0281e176932792928c9eaa99c9827"
        id                     = "lambdas/demo/get_roles_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag                   = "1c76021e4b9f2acc5357abab82e0896e" -> "40565557a2ffefdcb81a3bf560941405"
        id                     = "lambdas/demo/get_tags_by_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag                   = "4fd3d4974ddcee3a3299873520e1b1a5" -> "21eed276fc8ffbcfcb60f1675db7d5e6"
        id                     = "lambdas/demo/get_universe_overview_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag                   = "bc272945b588d69a731b9f0f1fac5a06" -> "dac37d65401cd161bd3c194272cb5034"
        id                     = "lambdas/demo/get_user_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag                   = "e9721a7ae621d772e52c529a73dbaeef" -> "1b693a96dd0020e7682d184f2b4ef644"
        id                     = "lambdas/demo/get_users_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag                   = "826cc90e0e174f700a8631ffddcb7bb3" -> "cf66230b7b88ac05bf7597d77148b886"
        id                     = "lambdas/demo/glue_trigger_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag                   = "67bd988e9bd93d734e50df14a6613566" -> "e91be977504af63520879191e2e3cc61"
        id                     = "layer/demo/layer_libraries.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag                   = "a90fe34b6a1a7937e76e2c73a454cee4" -> "f6366e7a9e06b4a7ee09fe72ce2db7d9"
        id                     = "lambdas/demo/message.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag                   = "de7a6f2d947b9e405f8ae44ffe88f70f" -> "09a998092877f7e9e7d10be08935844a"
        id                     = "lambdas/demo/modify_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag                   = "02185a01236ba10490afa6e8c3d33e24" -> "913a019ed69ff8f37bd187a827f6c3f3"
        id                     = "lambdas/demo/register.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag                   = "cf91d98537a20fceedc6e8ca0964fba4" -> "44c52b12beae62f576a05799667d8755"
        id                     = "lambdas/demo/update_data.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag                   = "3cfddd7419887b8dc1aa3fbd79cc2e7e" -> "24d1738d89d81ff4170d6e56c0ba8973"
        id                     = "lambdas/demo/update_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag                   = "688a2fcce0ca4ddea38fb64913fdcf69" -> "ee364cf2b41f1bb608db14781798ae82"
        id                     = "lambdas/demo/upload_file_s3_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag                   = "5a7785e5ce20354666bd0b1bdef918fe" -> "96027f8438bf6c673b0a49d6dac37571"
        id                     = "lambdas/demo/validate_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag                   = "7b23273347bc213cb703c5a7ee5f4a43" -> "a7e9931d70f6556b684be0b60366a08d"
        id                     = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "sCoikEC30zvJMt1/fCPQb2iFxpmSFBPEBDnZlxTwXSo=" -> "2BWT1PwPIVfcMDmlrbjsr7KoI73lMLYjE/5cCwG7VzI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "JiD2k6IcPCKtaouMcFIxa5W7itysuz5oU7p6YSxxJzM=" -> "69GnvDLykyZt0/1Yx6bMXfwD4mPjkdGY/zdIi1JI+sI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "aCuH9F3lFVh7q7bG48HfVjAWJwDVKJ6sfHZwr1Tdd74=" -> "niHNWHOECPWM7v1NfmEg7P0lLBU76yINRwXiUT/FstE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "38p1DgXoHWHdvNYCaWxi73oWcA/HuyOVkIT5oEAUA48=" -> "6Pq1sBbDKOBJcPuuj08mzuy3piI7csB6g7H5+WCA/go="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "qvkQC5ijMEO53xTeMPnDmHdxom2r8LpxJOWiHteT4Yo=" -> "sntNn+MzO+UgExbqEmkIPgObiSJCfIEaSoVJAhALxZg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "GWZFICI16Mmnitls4oICL9gJGxRmHUbtdIA2WMb+yt8=" -> "Z+k264slCLk7YWjUvpi4TEE1vPAtRdVHWdyvJX4iVq4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "NWjIrj+RRvnfUL1FDgQca3zatoqvyji7stfgatWySj0=" -> "0bOzg8Pl+PnkjdjUjj6e3rS+O0Uy/lsTqS2xbSFqGvA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "c8+fyGXo6On9CVDsENNC3DzLE3hqtVuAuwwIsaEaa6c=" -> "RfQ/dqyGor9qE5/ulpS6AwQsVOIF3lEMRzrjgLUVKr0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "yKvHYEcpKRSyX7rnGyF6B7IGKoh+vdltaGY3rpcqdKo=" -> "kxhybO0L3QQ/6E2eizC2y0c+snmDPrPwYZyTI0YGZQ0="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "qojgTDYT6Ub0KKt7905ehhRw0KkOarA8RoWyHnBd+vA=" -> "rA3HhWBr/8uk65GciZyIm3GGniu2MT08FJti32wzKgI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "yZ2dZzrcamyTXC7o9acgxyKCTewbdB56Mdd2+BwyQ/8=" -> "0A8P9slmek/zLqcBLVCetg4W9mlHlcHyrClwSCsWebA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "6GiMO4XimdCmYkQt8vfTM4REHKSLRKCQGTU9OQqTjn0=" -> "BqIHRg/cl2Aed5y/VcztVL1qF5h+18XyxXOM5shaOc4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "yZ3TypB3WSmN22FAI2IZqF7nTNfSEAmDtEti/alRq+I=" -> "eyAoyHyiznCGAIArwTyasbpLEHmeLoHzSZI4ogoyufM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "p7tKz+J81GNbBZ5DFM816T6q3O6k4PdeYnNKLYTNojs=" -> "KNWMkwIrjgcDmFTbXqXksEwOwghVQtljpL6jp5lDGek="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "/xyE9vXplVnn/dG+DDp4h7H2h2m6ERMh7g0fI17N2Hc=" -> "5Vw5fEPwU51duafXpu9AV9xHvEFkwUnAR2BLuuauyig="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "xa/302K44/xgMEo/c7iW79y+8xTh+jf6cjxrzCVXohc=" -> "SbMPP6vpIpvbO/YZdJVTHTM/K8ZbaNZfPJeC/e3dHfg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "xp4m5RykDHlvFYKP774h1NMLN1WdUcTXaWZPopu2B/Q=" -> "gXFTPCMFiJwbpgAj6jMDCnIHtYFVT2XLbUh+BTOdYC8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "FofZCyh15v+D3Ezz1gbtARiSATUmk0fluwfzsw9BoX0=" -> "vm/WMng4g4MBfiSlRJr7JTypxoKKqOyzALEqJ0tWOk4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "UUcCiNdh6txDzYU/A5vM9tmVCd5WAPOBOjxGDBaEvHc=" -> "u8bq4TxQhyUS15zveRJLn2gRq9ZMympVGGuWl6pwHO8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-02-22T18:34:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "2KOgushnSteholebq0lNY95fEqJvutNKhwLiScwreRw=" -> "3ImHRPENNDQI/5oTYaS9xN9oqGDugRhcDvN8P97orPY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "C7K82XGHsQachb5phRs+jwGr/BriEG8/M6c2zFYg1Io=" -> "ce5noHkmEREza17wiCQ8gmy1wKZvr02ck5UPrTPKUsU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "RuBPGp+2SuMbTRSVt9Smj1gmVjKyZDLn3cQeMH1vY+c=" -> "FxZhozE3XI+Bg2sn9y0/bfnGm2IX+tTJZoZXwgqzto0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "GEe0ku9n4Osbe6BbfAoT5fpe/3SzzxKBcGWDeu6iyko=" -> "MIKIr6/gMZVb9AIBdi3WFwn5/RGiaH0qI7dhq6pUdtk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "SH01WAsAaKusxQXaoOG6TikVVzCHCijE4C+xfcAHpWU=" -> "s5kkqIZ7cBJGChBvCR2KQibmpaiCQAczPHa7/g4q53Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "BbbEesoy20k7RNHw/kC4rpml+rCef/bpY+nsqdUcR4w=" -> "NnCoO92I6mfHZZGI4iW1bp4qwJ5UAuMvGwCxtiVl0fA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-02-22T18:50:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "7lec+69anKp+qySn71v4lYZExCLquN/6gek4R0VPEO4=" -> "6I2jAXFwOj/rpT1amcMBo1EE7SkpZ1+WdlsWH6B1FQc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ca7VqEBRd1sG8L+24gex6ElrC1rZneDTCuguZG+H2hY=" -> "gUwo7cDqcxoJsfqP9yS8CCuEJoaKyuh6jMQXMlDVDuw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "JWHxTlg5Q+Z+R2LZrT3qqWgXn0+WfWbYe6Zlwsvvrlw=" -> "dUeT4iQ3tVtHp2bg8Pb5s/zY6UmFopKfvNgTSqQMzq4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-02-22T18:40:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "FzOz6jOnS4O7JoKkeXcAvZorfBUo1oJbyYvkIDZy6Gw=" -> "2ykPklaURJdgfkRkoaHxaJBNa1FUlAnwVTbDtjcsfKo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "s1jtTsgLy8BLv6GdDOREYLMASbYG5U9WKaoYKl8ECkE=" -> "uhfSWT7NuPy964waIxTC0Mt+AMQNkoIKwIJmvhMaC3Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_quarters_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_quarters_report_lambda_function" {
        id                             = "demo_get_quarters_report_lambda_function"
      ~ last_modified                  = "2023-02-23T02:10:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "aqAQzUiQqYkm69Qz1Q7pPMJ+qtPj7T0l59XFFMziJV8=" -> "9FD6pRoQboJRjfvlKiSu8L3JHXOrj2ZhMTrVfiA2hQE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "YckJBSVlrHUF9UtqxJRUYxsLU7rvpsNsy9Wiy/RiXtA=" -> "jcDg2jAh52/UFzVW0eijeng4m0kp+Kq4R6je44bRVLo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "alVJxTV2UeyfGMInaIxRmlO7TF7dO1UcOsT+TKCeMhc=" -> "iM1EB8JXg87sw+1z/lt7wbXVRyHd7rLTZgguBSpwOho="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "kpGmehOTAedxtpxhdFrfmTMUNGNKV2Lp/rkYdv0R+nI=" -> "nVbG6DiQHIVl+w6gO/vDuE8TIpxO0toc67ZmbzhGw8E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "pOkK10OtJWgsmxfz9CyYLuYJjxahZGDWBZYIh5cnjZA=" -> "iBbbPUnobT2C3vj33rfBS2Pkq1MiSSqSmZvNwe1PS+s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "BryM2VMY//KXPI3EEH2wI2gLXF4tH0r6o+EyM9Der8s=" -> "STLFEAs1tW6+1GFkNefvkKRNkdeO2B81cNCi1qWlEcg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "PbcWe7E7x1wr9o/AJsWFMaTtAOTHyNulY3qJrpWAut0=" -> "+pYXurMxOrUT0qFa/6XUzxRuT7pQNOrKBlyNRy3SPoo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "vVA+iG7OQml6x7DcX1LmzbdC65UGazOKOUa1EIrm96s=" -> "WQluAOLFtJRUaU/FPzGUQpAKpLT8Py1/W5gbw5et9yc="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "CUGIJeH8habHelQZRnOsdcguCCd9gDJwqrw54ECUmr4=" -> "D4XytPdlwsqR6tOOK8o11sXBWm6xU2/5xYQ9CsaRUv4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "iJGpKfKBl+g8pnQwU/Kk9Q1w4wVjK/ngzIcqQQS2bXw=" -> "S8RYGHAZWwpZibRp2hWkf1+LX2L4Ur/d9P0907TvzAc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "t1seLdabUX3/GrwSkeDP8iEQhKwxT9ZqSnAvuiVHQCE=" -> "ruI/bxpK2NP7GeaZN/mQq+EZ7UXmjcindYiyGbecdMI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "bZPb0rkNMduUtZTNn/LVoocUtJddONklR07wYXGiSmA=" -> "RSadZwVZqco5aNQ1Qusuwh0zYyZu2w8NOXRjSx4m7H0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "O2s+HdSlOcREm2D4nc3bProI1iDwON1DVe08x0BR2Ow=" -> "VkbkCWQkYKkCpayKlHJYa9iYh7I6A/N0kh/gkGbx25A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "vKAgt2/WRVYqi+8/QYFrI1lMaLjJqGhw+kxNapAYJV4=" -> "5u92iEiGTWah6WSasIzTPVQ6EX56eRXrX0iXVGnqWZk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "ehKYQXHsw3KWgfz6nWFXs/NeTJlz3xbCnPg+n61pNmg=" -> "bJ//OtSu+8ck1rL5BJQq8sWjn60oip/UpieUNazBnTI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "64Xsh0e/Kv90AgznN7CuKYLYv8KNYLpk+2CFGHm/A74=" -> "nAX6Ug356jXmkjLKGprNlyaPTJLKsf4gLQM8ueuM7Hw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-02-17T14:53:29Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "7xufwb" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-02-17T14:53:28Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-02-17T14:53:28Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 95 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*